content/posts/20200530193932-budgetting.md
+++
title = "Budgetting"
author = ["Daniel Biasiotto"]
draft = false
+++

## [YouNeedABudget](https://www.youneedabudget.com/the-four-rules/) {#youneedabudget}



### Budget every Euro {#budget-every-euro}

Dovrei assegnare un compito ad ogni Euro che guadagno.


### Embrace your true expenses {#embrace-your-true-expenses}

Pianificare per le spese piu' impegnative e meno frequenti, per arrivarci preparati.


### Roll with the punches {#roll-with-the-punches}

Cambiare i budget in corso d'opera spostando soldi da un budget all'altro se si e' over-speso, l'obbiettivo e' continuare a tenere i conti.


### Age your money {#age-your-money}

Spendere meno di quanto quadagnato, l'obbietivo e' arrivare a spendere soldi che hanno un mese d'eta', cosi' non si e' piu' preoccupati per la fine del mese.


### Virtual Postings per i budget {#virtual-postings-per-i-budget}

2018-06-12 Budget
[Assets:Budget:Food]                         400.00 EUR
[Assets:Budget:Rent]                         600.00 EUR
[Assets:Budget:Utilities]                    600.00 EUR
[Equity:Budget]                            -1600.00 EUR

-   usando [...] ledger non le riportera' quando richiesto un report
    -   usando il flag: --real


## Ledger {#ledger}

-   [Fonte](https://www.reddit.com/r/emacs/comments/8x4xtt/tip_how_i_use_ledger_to_track_my_money/)
-   [Docs](https://www.ledger-cli.org/3.0/doc/ledger3.html#SEC_Contents)
-   [Features](https://www.ledger-cli.org/features.html)
-   [Blog](https://sachachua.com/blog/tag/ledger/?order=asc) di [Sacha Chua]({{< relref "20200531191654-sacha_chua.md" >}})
-   [Emacs Cafe'](https://emacs.cafe/ledger/emacs/ynab/budgeting/2018/06/12/elbank-ynab.html) di Nicolas Petton

<!--listend-->

```#+begin_src
 (use-package ledger-mode
    :mode ("\\.dat\\'"
           "\\.ledger\\'")
    :custom (ledger-clear-whole-transactions t))

 (use-package flycheck-ledger :after ledger-mode)
```


### <span class="org-todo done DONE">DONE</span> ledger deve essere installato {#ledger-deve-essere-installato}


### [Automated Transactions](https://www.ledger-cli.org/3.0/doc/ledger3.html#Automated-Transactions) {#automated-transactions}


#### An automated transaction is a special kind of transaction which adds its postings to other transactions any time one of that other transactions’ postings matches its predicate. The predicate uses the same query syntax as the Ledger command-line. {#an-automated-transaction-is-a-special-kind-of-transaction-which-adds-its-postings-to-other-transactions-any-time-one-of-that-other-transactions-postings-matches-its-predicate-dot-the-predicate-uses-the-same-query-syntax-as-the-ledger-command-line-dot}

= expr true
    Foo                          $50.00
    Bar                         $-50.00


#### se non e' specificata la commodity ($ sopra) allora dara' interpretato come un moltiplicatore {#se-non-e-specificata-la-commodity--sopra--allora-dara-interpretato-come-un-moltiplicatore}


#### l'espressione eredita tutte le variabili del post corrispondente alla regola {#l-espressione-eredita-tutte-le-variabili-del-post-corrispondente-alla-regola}

= expr true
    (Foo)                  (amount \* 2)  ; same as  just "2"
                                         ; this case

2012-03-10 KFC
    Expenses:Food                $20.00
    Assets:Cash

--&gt;

2012-03-10 KFC
   Expenses:Food                $20.00
   (Foo)                        $40.00
   Assets:Cash                 $-20.00
   (Foo)                       $-40.00


#### Data1=Data2 {#data1-data2}

<!--list-separator-->

-  per stimare delle date per uscite e entrate


### Structuring Accounts {#structuring-accounts}


#### Expenses: dove vanno i soldi {#expenses-dove-vanno-i-soldi}


#### Assets: dove stanno i soldi {#assets-dove-stanno-i-soldi}


#### Income: da dove arrivano i soldi {#income-da-dove-arrivano-i-soldi}


#### Liabilities: soldi che devo {#liabilities-soldi-che-devo}


#### Equity: il valore reale della mia proprieta' {#equity-il-valore-reale-della-mia-proprieta}

\*\*
